src/Documents/АктОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АктОказанияУслуг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленВКонтурСтрахование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОказанныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/СообщенияКонтурСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СообщенияКонтурСтрахование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>documentDate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>checkingStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationCompletionTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationStartTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastEventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>messageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reasons</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipientMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>senderMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>totalWorkTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеКС</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>mediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventDateTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АктОказанияУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
// Обработчик кнопки заполнения таблицы только не оплачеными приемами
Процедура ЗаполнитьПоДокументам(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(, "Укажите контрагента!");
		Возврат;	
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоДокументамЗавершение", ЭтотОбъект), "Таблица будет перезаполнена. Продолжить?",РежимДиалогаВопрос.ДаНет);
	 
КонецПроцедуры

&НаКлиенте   
// Процедура - Заполнить по документам завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗаполнитьПоДокументамЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Объект.ОказанныеУслуги.Количество() = 0 ИЛИ РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		ЗаполнитьТаблицуОказанныеУслуги(Объект.Контрагент,Истина);
		ПриемыПриИзменении(Неопределено);		 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик кнопки заполнения таблицы всеми приемами
Процедура ЗаполнитьВсемиПриемами(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(, "Укажите контрагента!");
		Возврат;	
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВопросОПерезаполненииТаблицыЗавершение", ЭтотОбъект), "Таблица будет перезаполнена. Продолжить?",РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ВопросОПерезаполненииТаблицыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Объект.ОказанныеУслуги.Количество() = 0 ИЛИ РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		ЗаполнитьТаблицуОказанныеУслуги(Объект.Контрагент,Ложь);
		ПриемыПриИзменении(Неопределено);		 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// При изменении содержимого таблицы приемов
Процедура ПриемыПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.ОказанныеУслуги.Итог("Сумма");
	ОбновитьЗаголовкиТабЧастейНаСервере();
	
КонецПроцедуры

&НаКлиенте
// При изменении суммы строки
Процедура ПриемыСуммаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ОказанныеУслуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПриемыПриемНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Документ.Прием.ФормаВыбора",,Элемент);
	// Подготовка отбора по контрагенту
	ГруппаИЛИПоКонтрагенту = ОтборыСписковКлиентСервер.СоздатьГруппуЭлементовОтбораКомпоновкиДанных(ФормаВыбора.Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаВыбора.Список, "ПолисМедСтрахования.СтраховаяКомпания", Объект.Контрагент, ЗначениеЗаполнено(Объект.Контрагент),,ГруппаИЛИПоКонтрагенту);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаВыбора.Список, "Контрагент", Объект.Контрагент, ЗначениеЗаполнено(Объект.Контрагент),,ГруппаИЛИПоКонтрагенту);
	// Подготовка отбора по дате
	ГруппаИПоДате = ОтборыСписковКлиентСервер.СоздатьГруппуЭлементовОтбораКомпоновкиДанных(ФормаВыбора.Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаВыбора.Список, "Дата", Объект.НачалоПериода, ЗначениеЗаполнено(Объект.НачалоПериода),ВидСравненияКомпоновкиДанных.БольшеИлиРавно,ГруппаИПоДате);
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ФормаВыбора.Список, "Дата", КонецДня(Объект.ОкончаниеПериода), ЗначениеЗаполнено(Объект.ОкончаниеПериода),ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,ГруппаИПоДате);
	ФормаВыбора.Открыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриемыПриемОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
	Элементы.Приемы.ТекущиеДанные.Сумма = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранноеЗначение,"СуммаДокумента");	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Заполнить таблицу акта отобранными документами прием
Функция ЗаполнитьТаблицуОказанныеУслуги(Контрагент,ТолькоНеОплченнымиДокументами)	
	
	ВременнаяТаблица = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ДанныеПоВзаиморасчетамДляКонтрагента(
		Объект.Контрагент,
		,Объект.СтруктурнаяЕдиница,
		ТолькоНеОплченнымиДокументами,,,
		Объект.Договор,
		Объект.Организация);
	
	Объект.ОказанныеУслуги.Очистить();
	Для Каждого СтрокаТ ИЗ ВременнаяТаблица Цикл	
		
		Если СтрокаТ.ДокументРеализации = Неопределено Тогда
			Продолжить;
		КонецЕсли;   
		
		Разрешено = Истина;
		Если  ЗначениеЗаполнено(Объект.НачалоПериода) И СтрокаТ.ДокументРеализации.Дата <= Объект.НачалоПериода Тогда
			Разрешено = Ложь;			
		КонецЕсли;			
		Если ЗначениеЗаполнено(Объект.ОкончаниеПериода) И СтрокаТ.ДокументРеализации.Дата >= КонецДня(Объект.ОкончаниеПериода) Тогда
			Разрешено = Ложь;
		КонецЕсли;		
		Если Разрешено Тогда
			НоваяСтрока                   = Объект.ОказанныеУслуги.Добавить();
			НоваяСтрока.ДокументОснования = СтрокаТ.ДокументРеализации;
			Если ТолькоНеОплченнымиДокументами Тогда
				НоваяСтрока.Сумма             = СтрокаТ.Задолженность;
			Иначе
				НоваяСтрока.Сумма             = СтрокаТ.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОписаниеУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслуги()
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) и  ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
		Период = " за период с " + Формат(Объект.НачалоПериода, "ДФ=""дд.ММ.гггг 'г.'""") + " по " + Формат(Объект.ОкончаниеПериода, "ДФ=""дд.ММ.гггг 'г.'""");	
	ИначеЕсли ЗначениеЗаполнено(Объект.НачалоПериода) и  не ЗначениеЗаполнено(Объект.ОкончаниеПериода)  Тогда
		Период = " за период с " + Формат(Объект.НачалоПериода, "ДФ=""дд.ММ.гггг 'г.'""");
	ИначеЕсли не ЗначениеЗаполнено(Объект.НачалоПериода) и  ЗначениеЗаполнено(Объект.ОкончаниеПериода)  Тогда
		Период = " за период по " + Формат(Объект.ОкончаниеПериода, "ДФ=""дд.ММ.гггг 'г.'""");	
	Иначе
		Период = "";
	КонецЕсли;
	ДоговорСтрока = "";
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		НомерДоговора = НомерДоговораКонтрагента(Объект.Договор);
		ДатаДоговора  = ДатаДоговораКонтрагента(Объект.Договор);
		Если ЗначениеЗаполнено(НомерДоговора) и ЗначениеЗаполнено(ДатаДоговора) Тогда
			ДоговорСтрока = " по договору №" + НомерДоговора + " от " + ДатаДоговора;
		ИначеЕсли  ЗначениеЗаполнено(НомерДоговора) и не ЗначениеЗаполнено(ДатаДоговора)  Тогда
			ДоговорСтрока = " по договору №" + НомерДоговора;
		ИначеЕсли  не ЗначениеЗаполнено(НомерДоговора) и ЗначениеЗаполнено(ДатаДоговора)  Тогда
			ДоговорСтрока = " по договору от " + ДатаДоговора;
		Иначе 
			ДоговорСтрока = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ОписаниеУслуги = "Оказание медицинских услуг" + Период + ДоговорСтрока;
	
КонецПроцедуры	

&НаСервере
Функция  НомерДоговораКонтрагента(Договор)
	Возврат Договор.НомерДоговора;
КонецФункции

&НаСервере
Функция ДатаДоговораКонтрагента(Договор)
	Возврат Формат(Договор.ДатаДоговора, "ДФ=""дд.ММ.гггг""");
КонецФункции

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ОписаниеУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	ОписаниеУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры


&НаСервере
// Процедура, создает меню управления табличными частями.
//
Процедура СоздатьМенюУправленияТабличнымиЧастями()
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("ОказанныеУслуги"   , "ГруппаОказанныеУслуги");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
		
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели.
//
Процедура ОбновитьЗаголовкиТабЧастейНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)

	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
			
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьМенюУправленияТабличнымиЧастями(); 
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	ВнешняяСистемаКС = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.КонтурСтрахование, Истина);

	Если ЗначениеЗаполнено(ВнешняяСистемаКС) Тогда
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияКонтурСтрахование.documentNumber КАК documentNumber,
		|	СообщенияКонтурСтрахование.checkingStatus КАК checkingStatus
		|ИЗ
		|	РегистрСведений.СообщенияКонтурСтрахование КАК СообщенияКонтурСтрахование
		|ГДЕ
		|	СообщенияКонтурСтрахование.documentNumber = &documentNumber";
		
		Запрос.УстановитьПараметр("documentNumber", Объект.Номер);

		РезультатЗапроса = Запрос.Выполнить();
	
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ЭтаФорма.ТолькоПросмотр = Истина;	
			
        КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемыПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиТабЧастейНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОписаниеУслуги();
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	// МассивДокументов = Объект.Ссылка;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "АктОказанияУслуг");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.АктОказанияУслуг.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаКлиенте 
// Процедура, Дата при изменении.
//
Процедура ДатаПриИзменении(Элемент)
	
    ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

#КонецОбласти
